openocd-org/openocd/src/flash/nor/stm32l4x.c
static const uint32_t stm32l4_flash_regs[STM32_FLASH_REG_INDEX_NUM] = {
	[STM32_FLASH_ACR_INDEX]      = 0x000,
	[STM32_FLASH_KEYR_INDEX]     = 0x008,
	[STM32_FLASH_OPTKEYR_INDEX]  = 0x00C,
	[STM32_FLASH_SR_INDEX]       = 0x010,
	[STM32_FLASH_CR_INDEX]       = 0x014,
	[STM32_FLASH_OPTR_INDEX]     = 0x020,
	[STM32_FLASH_WRP1AR_INDEX]   = 0x02C,
	[STM32_FLASH_WRP1BR_INDEX]   = 0x030,
	[STM32_FLASH_WRP2AR_INDEX]   = 0x04C,
	[STM32_FLASH_WRP2BR_INDEX]   = 0x050,
};

static const uint32_t stm32wl_cpu2_flash_regs[STM32_FLASH_REG_INDEX_NUM] = {
	[STM32_FLASH_ACR_INDEX]      = 0x000,
	[STM32_FLASH_KEYR_INDEX]     = 0x008,
	[STM32_FLASH_OPTKEYR_INDEX]  = 0x010,
	[STM32_FLASH_SR_INDEX]       = 0x060,
	[STM32_FLASH_CR_INDEX]       = 0x064,
	[STM32_FLASH_CR_WLK_INDEX]   = 0x014,
	[STM32_FLASH_OPTR_INDEX]     = 0x020,
	[STM32_FLASH_WRP1AR_INDEX]   = 0x02C,
	[STM32_FLASH_WRP1BR_INDEX]   = 0x030,
};

static const uint32_t stm32l5_ns_flash_regs[STM32_FLASH_REG_INDEX_NUM] = {
	[STM32_FLASH_ACR_INDEX]      = 0x000,
	[STM32_FLASH_KEYR_INDEX]     = 0x008, /* NSKEYR */
	[STM32_FLASH_OPTKEYR_INDEX]  = 0x010,
	[STM32_FLASH_SR_INDEX]       = 0x020, /* NSSR */
	[STM32_FLASH_CR_INDEX]       = 0x028, /* NSCR */
	[STM32_FLASH_OPTR_INDEX]     = 0x040,
	[STM32_FLASH_WRP1AR_INDEX]   = 0x058,
	[STM32_FLASH_WRP1BR_INDEX]   = 0x05C,
	[STM32_FLASH_WRP2AR_INDEX]   = 0x068,
	[STM32_FLASH_WRP2BR_INDEX]   = 0x06C,
};

static const uint32_t stm32l5_s_flash_regs[STM32_FLASH_REG_INDEX_NUM] = {
	[STM32_FLASH_ACR_INDEX]      = 0x000,
	[STM32_FLASH_KEYR_INDEX]     = 0x00C, /* SECKEYR */
	[STM32_FLASH_OPTKEYR_INDEX]  = 0x010,
	[STM32_FLASH_SR_INDEX]       = 0x024, /* SECSR */
	[STM32_FLASH_CR_INDEX]       = 0x02C, /* SECCR */
	[STM32_FLASH_OPTR_INDEX]     = 0x040,
	[STM32_FLASH_WRP1AR_INDEX]   = 0x058,
	[STM32_FLASH_WRP1BR_INDEX]   = 0x05C,
	[STM32_FLASH_WRP2AR_INDEX]   = 0x068,
	[STM32_FLASH_WRP2BR_INDEX]   = 0x06C,
};

struct stm32l4_rev {
	const uint16_t rev;
	const char *str;
};

struct stm32l4_part_info {
	uint16_t id;
	const char *device_str;
	const struct stm32l4_rev *revs;
	const size_t num_revs;
	const uint16_t max_flash_size_kb;
	const uint32_t flags; /* one bit per feature, see STM32L4 flags: macros F_XXX */
	const uint32_t flash_regs_base;
	const uint32_t fsize_addr;
	const uint32_t otp_base;
	const uint32_t otp_size;
};

struct stm32l4_flash_bank {
	bool probed;
	uint32_t idcode;
	unsigned int bank1_sectors;
	bool dual_bank_mode;
	int hole_sectors;
	uint32_t user_bank_size;
	uint32_t data_width;
	uint32_t cr_bker_mask;
	uint32_t sr_bsy_mask;
	uint32_t wrpxxr_mask;
	const struct stm32l4_part_info *part_info;
	uint32_t flash_regs_base;
	const uint32_t *flash_regs;
	bool otp_enabled;
	enum stm32l4_rdp rdp;
	bool tzen;
	uint32_t optr;
};

enum stm32_bank_id {
	STM32_BANK1,
	STM32_BANK2,
	STM32_ALL_BANKS
};

struct stm32l4_wrp {
	enum stm32l4_flash_reg_index reg_idx;
	uint32_t value;
	bool used;
	int first;
	int last;
	int offset;
};

/* human readable list of families this drivers supports (sorted alphabetically) */
static const char *device_families = "STM32C0/G0/G4/L4/L4+/L5/U0/U3/U5/WB/WBA/WL";

static const struct stm32l4_rev stm32l47_l48xx_revs[] = {
	{ 0x1000, "1" }, { 0x1001, "2" }, { 0x1003, "3" }, { 0x1007, "4" }
};

static const struct stm32l4_rev stm32u3b_u3cxx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" },
};

static const struct stm32l4_rev stm32l43_l44xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" }, { 0x2001, "Y" },
};


static const struct stm32l4_rev stm32c01xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" },
};

static const struct stm32l4_rev stm32c03xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" },
};

static const struct stm32l4_rev stm32c05xx_revs[] = {
	{ 0x1000, "A" },
};

static const struct stm32l4_rev stm32c071xx_revs[] = {
	{ 0x1001, "Z" },
};

static const struct stm32l4_rev stm32c09xx_revs[] = {
	{ 0x1000, "A" },
};

static const struct stm32l4_rev stm32g05_g06xx_revs[] = {
	{ 0x1000, "A" },
};

static const struct stm32l4_rev stm32_g07_g08xx_revs[] = {
	{ 0x1000, "A/Z" } /* A and Z, no typo in RM! */, { 0x2000, "B" },
};

static const struct stm32l4_rev stm32l49_l4axx_revs[] = {
	{ 0x1000, "A" }, { 0x2000, "B" },
};

static const struct stm32l4_rev stm32l45_l46xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" }, { 0x2001, "Y" },
};

static const struct stm32l4_rev stm32l41_l42xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" }, { 0x2001, "Y" },
};

static const struct stm32l4_rev stm32g03_g04xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" }, { 0x2000, "B" },
};

static const struct stm32l4_rev stm32g0b_g0cxx_revs[] = {
	{ 0x1000, "A" },
};

static const struct stm32l4_rev stm32u0xx_revs[] = {
	{ 0x1000, "A" },
};

static const struct stm32l4_rev stm32u37_u38xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" },
};

static const struct stm32l4_rev stm32g43_g44xx_revs[] = {
	{ 0x1000, "A" }, { 0x2000, "B" }, { 0x2001, "Z" },
};

static const struct stm32l4_rev stm32g47_g48xx_revs[] = {
	{ 0x1000, "A" }, { 0x2000, "B" }, { 0x2001, "Z" },
};

static const struct stm32l4_rev stm32l4r_l4sxx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" }, { 0x1003, "Y" }, { 0x100F, "W" },
	{ 0x101F, "V" },
};

static const struct stm32l4_rev stm32l4p_l4qxx_revs[] = {
	{ 0x1001, "Z" },
};

static const struct stm32l4_rev stm32l55_l56xx_revs[] = {
	{ 0x1000, "A" }, { 0x2000, "B" }, { 0x2001, "Z" },
};

static const struct stm32l4_rev stm32g49_g4axx_revs[] = {
	{ 0x1000, "A" },
};

static const struct stm32l4_rev stm32u53_u54xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" },
};

static const struct stm32l4_rev stm32u57_u58xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" }, { 0x1003, "Y" }, { 0x2000, "B" },
	{ 0x2001, "X" }, { 0x3000, "C" }, { 0x3001, "W" }, { 0x3007, "U" },
};

static const struct stm32l4_rev stm32u59_u5axx_revs[] = {
	{ 0x3001, "X" }, { 0x3002, "W" },
};

static const struct stm32l4_rev stm32u5f_u5gxx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" },
};

static const struct stm32l4_rev stm32wba5x_revs[] = {
	{ 0x1000, "A" },
};

static const struct stm32l4_rev stm32wba6x_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" },
};

