openocd-org/openocd/src/flash/nor/stm32l4x.c
	if (stm32l4_info->tzen && (stm32l4_info->rdp == RDP_LEVEL_0)) {
		/* restore all FLASH pages as non-secure */
		int retval3 = stm32l4_set_secbb(bank, FLASH_SECBB_NON_SECURE);
		if (retval3 != ERROR_OK)
			return retval3;
	}

	if (retval != ERROR_OK) {
		LOG_ERROR("block write failed");
		return retval;
	}
	return retval2;
}

static int stm32l4_read_idcode(struct flash_bank *bank, uint32_t *id)
{
	int retval = ERROR_OK;
	struct target *target = bank->target;

	/* try reading possible IDCODE registers, in the following order */
	uint32_t dbgmcu_idcode[] = {DBGMCU_IDCODE_L4_G4, DBGMCU_IDCODE_L5, DBGMCU_IDCODE_G0};

	for (unsigned int i = 0; i < ARRAY_SIZE(dbgmcu_idcode); i++) {
		retval = target_read_u32(target, dbgmcu_idcode[i], id);
		if ((retval == ERROR_OK) && ((*id & 0xfff) != 0) && ((*id & 0xfff) != 0xfff))
			return ERROR_OK;
	}

	/* Workaround for STM32WL5x devices:
	 * DBGMCU_IDCODE cannot be read using CPU1 (Cortex-M0+) at AP1,
	 * to solve this read the UID64 (IEEE 64-bit unique device ID register) */

	struct armv7m_common *armv7m = target_to_armv7m_safe(target);
	if (!armv7m) {
		LOG_ERROR("Flash requires Cortex-M target");
		return ERROR_TARGET_INVALID;
	}

	/* CPU2 (Cortex-M0+) is supported only with non-hla adapters because it is on AP1.
	 * Using HLA adapters armv7m.debug_ap is null, and checking ap_num triggers a segfault */
	if (cortex_m_get_impl_part(target) == CORTEX_M0P_PARTNO &&
			armv7m->debug_ap && armv7m->debug_ap->ap_num == 1) {
		uint32_t uid64_ids;

		/* UID64 is contains
		 *  - Bits 63:32 : DEVNUM (unique device number, different for each individual device)
		 *  - Bits 31:08 : STID (company ID) = 0x0080E1
		 *  - Bits 07:00 : DEVID (device ID) = 0x15
		 *
		 *  read only the fixed values {STID,DEVID} from UID64_IDS to identify the device as STM32WLx
		 */
		retval = target_read_u32(target, UID64_IDS, &uid64_ids);
		if (retval == ERROR_OK && uid64_ids == UID64_IDS_STM32WL) {
			/* force the DEV_ID to DEVID_STM32WLE_WL5XX and the REV_ID to unknown */
			*id = DEVID_STM32WLE_WL5XX;
			return ERROR_OK;
		}
	}

	LOG_ERROR("can't get the device id");
	return (retval == ERROR_OK) ? ERROR_FAIL : retval;
}

static const char *get_stm32l4_rev_str(struct flash_bank *bank)
{
	struct stm32l4_flash_bank *stm32l4_info = bank->driver_priv;
	const struct stm32l4_part_info *part_info = stm32l4_info->part_info;
	assert(part_info);

	const uint16_t rev_id = stm32l4_info->idcode >> 16;
	for (unsigned int i = 0; i < part_info->num_revs; i++) {
		if (rev_id == part_info->revs[i].rev)
			return part_info->revs[i].str;
	}
	return "'unknown'";
}

static const char *get_stm32l4_bank_type_str(struct flash_bank *bank)
{
	struct stm32l4_flash_bank *stm32l4_info = bank->driver_priv;
	assert(stm32l4_info->part_info);
	return stm32l4_is_otp(bank) ? "OTP" :
			stm32l4_info->dual_bank_mode ? "Flash dual" :
			"Flash single";
}

static int stm32l4_probe(struct flash_bank *bank)
{
	struct target *target = bank->target;
	struct stm32l4_flash_bank *stm32l4_info = bank->driver_priv;
	const struct stm32l4_part_info *part_info;
	uint16_t flash_size_kb = 0xffff;

	if (!target_was_examined(target)) {
		LOG_ERROR("Target not examined yet");
		return ERROR_TARGET_NOT_EXAMINED;
	}

	struct armv7m_common *armv7m = target_to_armv7m_safe(target);
	if (!armv7m) {
		LOG_ERROR("Flash requires Cortex-M target");
		return ERROR_TARGET_INVALID;
	}

	stm32l4_info->probed = false;

	/* read stm32 device id registers */
	int retval = stm32l4_read_idcode(bank, &stm32l4_info->idcode);
	if (retval != ERROR_OK)
		return retval;

	const uint32_t device_id = stm32l4_info->idcode & 0xFFF;

	for (unsigned int n = 0; n < ARRAY_SIZE(stm32l4_parts); n++) {
		if (device_id == stm32l4_parts[n].id) {
			stm32l4_info->part_info = &stm32l4_parts[n];
			break;
		}
	}

	if (!stm32l4_info->part_info) {
		LOG_WARNING("Cannot identify target as an %s family device.", device_families);
		return ERROR_FAIL;
	}

	part_info = stm32l4_info->part_info;
	const char *rev_str = get_stm32l4_rev_str(bank);
	const uint16_t rev_id = stm32l4_info->idcode >> 16;

	LOG_INFO("device idcode = 0x%08" PRIx32 " (%s - Rev %s : 0x%04x)",
			stm32l4_info->idcode, part_info->device_str, rev_str, rev_id);

	stm32l4_info->flash_regs_base = stm32l4_info->part_info->flash_regs_base;
	stm32l4_info->data_width = (part_info->flags & F_QUAD_WORD_PROG) ? 16 : 8;
	stm32l4_info->cr_bker_mask = FLASH_BKER;
	stm32l4_info->sr_bsy_mask = FLASH_BSY;

	/* Set flash write alignment boundaries.
	 * Ask the flash infrastructure to ensure required alignment */
	bank->write_start_alignment = stm32l4_info->data_width;
	bank->write_end_alignment = stm32l4_info->data_width;

	/* Initialize the flash registers layout */
	if (part_info->flags & F_HAS_L5_FLASH_REGS)
		stm32l4_info->flash_regs = stm32l5_ns_flash_regs;
	else
		stm32l4_info->flash_regs = stm32l4_flash_regs;

	/* read flash option register */
	retval = stm32l4_read_flash_reg_by_index(bank, STM32_FLASH_OPTR_INDEX, &stm32l4_info->optr);
	if (retval != ERROR_OK)
		return retval;

	stm32l4_sync_rdp_tzen(bank);

	/* for devices with TrustZone, use flash secure registers when TZEN=1 and RDP is LEVEL_0 */
	if (stm32l4_info->tzen && (stm32l4_info->rdp == RDP_LEVEL_0)) {
		if (part_info->flags & F_HAS_L5_FLASH_REGS) {
			stm32l4_info->flash_regs_base |= STM32L5_REGS_SEC_OFFSET;
			stm32l4_info->flash_regs = stm32l5_s_flash_regs;
		} else {
			LOG_ERROR("BUG: device supported incomplete");
			return ERROR_NOT_IMPLEMENTED;
		}
	}

	if (part_info->flags & F_HAS_TZ)
		LOG_INFO("TZEN = %d : TrustZone %s by option bytes",
				stm32l4_info->tzen,
				stm32l4_info->tzen ? "enabled" : "disabled");

	LOG_INFO("RDP level %s (0x%02X)",
			stm32l4_info->rdp == RDP_LEVEL_0 ? "0" : stm32l4_info->rdp == RDP_LEVEL_0_5 ? "0.5" : "1",
			stm32l4_info->rdp);

	if (stm32l4_is_otp(bank)) {
		bank->size = part_info->otp_size;

		LOG_INFO("OTP size is %d bytes, base address is " TARGET_ADDR_FMT, bank->size, bank->base);

		/* OTP memory is considered as one sector */
		free(bank->sectors);
		bank->num_sectors = 1;
		bank->sectors = alloc_block_array(0, part_info->otp_size, 1);

		if (!bank->sectors) {
			LOG_ERROR("failed to allocate bank sectors");
			return ERROR_FAIL;
		}

		stm32l4_info->probed = true;
		return ERROR_OK;
	} else if (bank->base != STM32_FLASH_BANK_BASE && bank->base != STM32_FLASH_S_BANK_BASE) {
		LOG_ERROR("invalid bank base address");
		return ERROR_FAIL;
	}

	/* get flash size from target. */
	retval = target_read_u16(target, part_info->fsize_addr, &flash_size_kb);

	/* failed reading flash size or flash size invalid (early silicon),
	 * default to max target family */
	if (retval != ERROR_OK || flash_size_kb == 0xffff || flash_size_kb == 0
			|| flash_size_kb > part_info->max_flash_size_kb) {
		LOG_WARNING("STM32 flash size failed, probe inaccurate - assuming %dk flash",
			part_info->max_flash_size_kb);
		flash_size_kb = part_info->max_flash_size_kb;
	}

	/* if the user sets the size manually then ignore the probed value
	 * this allows us to work around devices that have a invalid flash size register value */
	if (stm32l4_info->user_bank_size) {
		LOG_WARNING("overriding size register by configured bank size - MAY CAUSE TROUBLE");
		flash_size_kb = stm32l4_info->user_bank_size / 1024;
	}

	LOG_INFO("flash size = %d KiB", flash_size_kb);

	/* did we assign a flash size? */
	assert((flash_size_kb != 0xffff) && flash_size_kb);

	const bool is_max_flash_size = flash_size_kb == stm32l4_info->part_info->max_flash_size_kb;

	stm32l4_info->bank1_sectors = 0;
	stm32l4_info->hole_sectors = 0;

	int num_pages = 0;
	int page_size_kb = 0;

	stm32l4_info->dual_bank_mode = false;

	switch (device_id) {
	case DEVID_STM32L47_L48XX:
	case DEVID_STM32L49_L4AXX:
		/* if flash size is max (1M) the device is always dual bank
		 * STM32L47/L48xx: has variants with 512K
		 * STM32L49/L4Axx: has variants with 512 and 256
		 * for these variants:
		 *   if DUAL_BANK = 0 -> single bank
		 *   else -> dual bank without gap
		 * note: the page size is invariant
		 */
		page_size_kb = 2;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;

		/* check DUAL_BANK option bit if the flash is less than 1M */
		if (is_max_flash_size || (stm32l4_info->optr & FLASH_L4_DUAL_BANK)) {
			stm32l4_info->dual_bank_mode = true;
			stm32l4_info->bank1_sectors = num_pages / 2;
		}
		break;
	case DEVID_STM32L43_L44XX:
	case DEVID_STM32C01XX:
	case DEVID_STM32C03XX:
	case DEVID_STM32C05XX:
	case DEVID_STM32C071XX:
	case DEVID_STM32C09XX:
	case DEVID_STM32G05_G06XX:
	case DEVID_STM32G07_G08XX:
	case DEVID_STM32U031XX:
	case DEVID_STM32U073_U083XX:
	case DEVID_STM32L45_L46XX:
	case DEVID_STM32L41_L42XX:
	case DEVID_STM32G03_G04XX:
	case DEVID_STM32G43_G44XX:
	case DEVID_STM32G49_G4AXX:
	case DEVID_STM32WB1XX:
		/* single bank flash */
		page_size_kb = 2;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;
		break;
	case DEVID_STM32G0B_G0CXX:
		/* single/dual bank depending on DUAL_BANK option bit */
		page_size_kb = 2;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;
		stm32l4_info->cr_bker_mask = FLASH_BKER_G0;

