openocd-org/openocd/src/flash/nor/stm32l4x.c
		/* check DUAL_BANK bit */
		if (stm32l4_info->optr & FLASH_G0_DUAL_BANK) {
			stm32l4_info->sr_bsy_mask = FLASH_BSY | FLASH_BSY2;
			stm32l4_info->dual_bank_mode = true;
			stm32l4_info->bank1_sectors = num_pages / 2;
		}
		break;
	case DEVID_STM32G47_G48XX:
		/* STM32G47/8 can be single/dual bank:
		 *   if DUAL_BANK = 0 -> single bank
		 *   else -> dual bank WITH gap
		 */
		page_size_kb = 4;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;
		if (stm32l4_info->optr & FLASH_G4_DUAL_BANK) {
			stm32l4_info->dual_bank_mode = true;
			page_size_kb = 2;
			num_pages = flash_size_kb / page_size_kb;
			stm32l4_info->bank1_sectors = num_pages / 2;

			/* for devices with trimmed flash, there is a gap between both banks */
			stm32l4_info->hole_sectors =
				(part_info->max_flash_size_kb - flash_size_kb) / (2 * page_size_kb);
		}
		break;
	case DEVID_STM32L4R_L4SXX:
	case DEVID_STM32L4P_L4QXX:
		/* STM32L4R/S can be single/dual bank:
		 *   if size = 2M check DBANK bit
		 *   if size = 1M check DB1M bit
		 * STM32L4P/Q can be single/dual bank
		 *   if size = 1M check DBANK bit
		 *   if size = 512K check DB512K bit (same as DB1M bit)
		 */
		page_size_kb = 8;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;
		if ((is_max_flash_size && (stm32l4_info->optr & FLASH_L4R_DBANK)) ||
			(!is_max_flash_size && (stm32l4_info->optr & FLASH_LRR_DB1M))) {
			stm32l4_info->dual_bank_mode = true;
			page_size_kb = 4;
			num_pages = flash_size_kb / page_size_kb;
			stm32l4_info->bank1_sectors = num_pages / 2;
		}
		break;
	case DEVID_STM32L55_L56XX:
		/* STM32L55/L56xx can be single/dual bank:
		 *   if size = 512K check DBANK bit
		 *   if size = 256K check DB256K bit
		 *
		 * default page size is 4kb, if DBANK = 1, the page size is 2kb.
		 */

		page_size_kb = (stm32l4_info->optr & FLASH_L5_DBANK) ? 2 : 4;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;

		if ((is_max_flash_size && (stm32l4_info->optr & FLASH_L5_DBANK)) ||
			(!is_max_flash_size && (stm32l4_info->optr & FLASH_L5_DB256))) {
			stm32l4_info->dual_bank_mode = true;
			stm32l4_info->bank1_sectors = num_pages / 2;
		}
		break;
	case DEVID_STM32U3B_U3CXX:
	case DEVID_STM32U37_U38XX:
		page_size_kb = 4;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;
		if (is_max_flash_size || (stm32l4_info->optr & FLASH_U5_DUALBANK)) {
			stm32l4_info->dual_bank_mode = true;
			stm32l4_info->bank1_sectors = num_pages / 2;
		}
		break;
	case DEVID_STM32U53_U54XX:
	case DEVID_STM32U57_U58XX:
	case DEVID_STM32U59_U5AXX:
	case DEVID_STM32U5F_U5GXX:
		/* according to RM0456 Rev 4, Chapter 7.3.1 and 7.9.13
		 * U53x/U54x have 512K max flash size:
		 *   512K variants are always in DUAL BANK mode
		 *   256K and 128K variants can be in DUAL BANK mode if FLASH_OPTR:DUALBANK is set
		 * U57x/U58x have 2M max flash size:
		 *   2M variants are always in DUAL BANK mode
		 *   1M variants can be in DUAL BANK mode if FLASH_OPTR:DUALBANK is set
		 * U59x/U5Ax/U5Fx/U5Gx have 4M max flash size:
		 *   4M variants are always in DUAL BANK mode
		 *   2M variants can be in DUAL BANK mode if FLASH_OPTR:DUALBANK is set
		 * Note: flash banks are always contiguous
		 */

		page_size_kb = 8;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;
		if (is_max_flash_size || (stm32l4_info->optr & FLASH_U5_DUALBANK)) {
			stm32l4_info->dual_bank_mode = true;
			stm32l4_info->bank1_sectors = num_pages / 2;
		}
		break;
	case DEVID_STM32WBA5X:
	case DEVID_STM32WBA6X:
		/* according to RM0493 Rev 7, Chapter 7.3.1
		 * WBA5xx have 8K page size and are always
		 *  single bank.
		 * According to RM0515 Rev 4, Chapter 7.3.1
		 * WBA6xx have 8K page size and are always
		 * DUAL BANK
		 */
		page_size_kb = 8;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;
		if (stm32l4_info->optr & FLASH_U5_DUALBANK) {
			stm32l4_info->dual_bank_mode = true;
			stm32l4_info->bank1_sectors = num_pages / 2;
		}
		break;
	case DEVID_STM32WB5XX:
	case DEVID_STM32WB3XX:
	case DEVID_STM32WBA2X:
		/* single bank flash */
		page_size_kb = 4;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;
		break;
	case DEVID_STM32WLE_WL5XX:
		/* single bank flash */
		page_size_kb = 2;
		num_pages = flash_size_kb / page_size_kb;
		stm32l4_info->bank1_sectors = num_pages;

		/* CPU2 (Cortex-M0+) is supported only with non-hla adapters because it is on AP1.
		 * Using HLA adapters armv7m->debug_ap is null, and checking ap_num triggers a segfault */
		if (armv7m->debug_ap && armv7m->debug_ap->ap_num == 1)
			stm32l4_info->flash_regs = stm32wl_cpu2_flash_regs;
		break;
	default:
		LOG_ERROR("unsupported device");
		return ERROR_FAIL;
	}

	/* ensure that at least there is 1 flash sector / page */
	if (num_pages == 0) {
		if (stm32l4_info->user_bank_size)
			LOG_ERROR("The specified flash size is less than page size");

		LOG_ERROR("Flash pages count cannot be zero");
		return ERROR_FAIL;
	}

	LOG_INFO("flash mode : %s-bank", stm32l4_info->dual_bank_mode ? "dual" : "single");

	const int gap_size_kb = stm32l4_info->hole_sectors * page_size_kb;

	if (gap_size_kb != 0) {
		LOG_INFO("gap detected from 0x%08x to 0x%08x",
			STM32_FLASH_BANK_BASE + stm32l4_info->bank1_sectors
				* page_size_kb * 1024,
			STM32_FLASH_BANK_BASE + (stm32l4_info->bank1_sectors
				* page_size_kb + gap_size_kb) * 1024 - 1);
	}

	/* number of significant bits in WRPxxR differs per device,
	 * always right adjusted, on some devices non-implemented
	 * bits read as '0', on others as '1' ...
	 * notably G4 Cat. 2 implement only 6 bits, contradicting the RM
	 */

	/* use *max_flash_size* instead of actual size as the trimmed versions
	 * certainly use the same number of bits
	 */
	uint32_t max_pages = stm32l4_info->part_info->max_flash_size_kb / page_size_kb;

	/* in dual bank mode number of pages is doubled, but extra bit is bank selection */
	stm32l4_info->wrpxxr_mask = ((max_pages >> (stm32l4_info->dual_bank_mode ? 1 : 0)) - 1);
	assert((stm32l4_info->wrpxxr_mask & 0xFFFF0000) == 0);
	LOG_DEBUG("WRPxxR mask 0x%04" PRIx16, (uint16_t)stm32l4_info->wrpxxr_mask);

	free(bank->sectors);

	bank->size = (flash_size_kb + gap_size_kb) * 1024;
	bank->num_sectors = num_pages;
	bank->sectors = malloc(sizeof(struct flash_sector) * bank->num_sectors);
	if (!bank->sectors) {
		LOG_ERROR("failed to allocate bank sectors");
		return ERROR_FAIL;
	}

	for (unsigned int i = 0; i < bank->num_sectors; i++) {
		bank->sectors[i].offset = i * page_size_kb * 1024;
		/* in dual bank configuration, if there is a gap between banks
		 * we fix up the sector offset to consider this gap */
		if (i >= stm32l4_info->bank1_sectors && stm32l4_info->hole_sectors)
			bank->sectors[i].offset += gap_size_kb * 1024;
		bank->sectors[i].size = page_size_kb * 1024;
		bank->sectors[i].is_erased = -1;
		bank->sectors[i].is_protected = 1;
	}

	stm32l4_info->probed = true;
	return ERROR_OK;
}

static int stm32l4_auto_probe(struct flash_bank *bank)
{
	struct stm32l4_flash_bank *stm32l4_info = bank->driver_priv;
	if (stm32l4_info->probed) {
		uint32_t optr_cur;

		/* save flash_regs_base */
		uint32_t saved_flash_regs_base = stm32l4_info->flash_regs_base;

		/* for devices with TrustZone, use NS flash registers to read OPTR */
		if (stm32l4_info->part_info->flags & F_HAS_L5_FLASH_REGS)
			stm32l4_info->flash_regs_base &= ~STM32L5_REGS_SEC_OFFSET;

		/* read flash option register and re-probe if optr value is changed */
		int retval = stm32l4_read_flash_reg_by_index(bank, STM32_FLASH_OPTR_INDEX, &optr_cur);

		/* restore saved flash_regs_base */
		stm32l4_info->flash_regs_base = saved_flash_regs_base;

